In [2]:
import pandas as pd
import numpy as np

# Ordenar Base

In [11]:
df = pd.DataFrame({
    'X' : [25,25,25,37,37,37,45,45,54,2,2],
    'Y' : [4,7,12,56,26,78,94,23,56,34,800],
})

In [12]:
df.sort_values(by='X', ascending=False,inplace = True)

In [13]:
df.sort_values(['X', 'Y'], ascending=[True, False], inplace = True)

In [14]:
df

     X    Y
10   2  800
9    2   34
2   25   12
1   25    7
0   25    4
5   37   78
3   37   56
4   37   26
6   45   94
7   45   23
8   54   56

# Tratamento de nulos/vazios

In [5]:
asdf = pd.Series([1, np.nan, 4, 5, 7, 12, np.nan, np.nan])

In [6]:
asdf.dropna()

0     1.0
2     4.0
3     5.0
4     7.0
5    12.0
dtype: float64

In [8]:
asdf[asdf.notnull()]

0     1.0
2     4.0
3     5.0
4     7.0
5    12.0
dtype: float64

In [16]:
txs2 = pd.DataFrame({
    'X' : [1,np.nan,2,12,np.nan],
    'Y' : [4,3,2,np.nan,np.nan],
    'Z' : [2,np.nan,np.nan,np.nan,np.nan],
    'W' : [np.nan,np.nan,np.nan,np.nan,np.nan]
})

In [10]:
txs2.dropna() #descarta qualquer linha com vazio

     X    Y    Z
0  1.0  4.0  2.0

In [17]:
txs2.dropna(how='all') #so deleta linhas que só possuem vazio

      X    Y    Z   W
0   1.0  4.0  2.0 NaN
1   NaN  3.0  NaN NaN
2   2.0  2.0  NaN NaN
3  12.0  NaN  NaN NaN

In [19]:
txs2.dropna(axis=1, how='all') #so deleta colunas que so possuem vazio

      X    Y    Z
0   1.0  4.0  2.0
1   NaN  3.0  NaN
2   2.0  2.0  NaN
3  12.0  NaN  NaN
4   NaN  NaN  NaN

In [25]:
txs2 = pd.DataFrame({
    'X' : [1,np.nan,2,12,np.nan],
    'Y' : [4,3,2,np.nan,np.nan],
    'Z' : [2,np.nan,4,np.nan,np.nan],
    'W' : [5,np.nan,9,np.nan,np.nan]
})
txs2

      X    Y    Z    W
0   1.0  4.0  2.0  5.0
1   NaN  3.0  NaN  NaN
2   2.0  2.0  4.0  9.0
3  12.0  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN

In [24]:
txs2.dropna(thresh=4) #so mantem linhas que possuem 4 observacoes

     X    Y    Z    W
0  1.0  4.0  2.0  5.0
2  2.0  2.0  4.0  9.0

In [27]:
txs2.fillna({'X' : 0.5,'Y' : 2, 'Z' : 0.4, 'W' : 12}) 
#coloca o valor definido em cada coluna. Caso deseje alterar no dataframe, colocar inplace=True

      X    Y    Z     W
0   1.0  4.0  2.0   5.0
1   0.5  3.0  0.4  12.0
2   2.0  2.0  4.0   9.0
3  12.0  2.0  0.4  12.0
4   0.5  2.0  0.4  12.0

In [30]:
txs2['X'].fillna(txs2['X'].mean()) #preeche os NA da coluna especificada com a média

0     1.0
1     5.0
2     2.0
3    12.0
4     5.0
Name: X, dtype: float64

In [33]:
txs2['X'].fillna(txs2['X'].median()) #preenche com mediana

0     1.0
1     2.0
2     2.0
3    12.0
4     2.0
Name: X, dtype: float64

# Tratamento Duplicados

In [49]:
txs2 = pd.DataFrame({
    'X' : ['A','A','B','C'],
    'Y' : ['A','A','B','C'],
    'Z' : ['A','A','C','A'],
})
txs2

   X  Y  Z
0  A  A  A
1  A  A  A
2  B  B  C
3  C  C  A

Dados duplicados

In [42]:
txs2.duplicated() #linha 1 é copia da 0

0    False
1     True
2    False
3    False
dtype: bool

In [43]:
txs2.drop_duplicates()

   X  Y  Z
0  A  A  A
2  B  B  C
3  C  C  A

In [51]:
txs2.drop_duplicates(['Z']) #remove as linhas duplicadas de uma coluna especifica

   X  Y  Z
0  A  A  A
2  B  B  C

In [57]:
txs2.drop_duplicates(['X','Y'], keep='last') #remove a primeira observacao duplicada |

   X  Y  Z
1  A  A  A
2  B  B  C
3  C  C  A

# Tratamento Discrepantes

In [52]:
txs2 = pd.DataFrame({
    'X' : [25,32,3,7,8,12,34,1200,54,34,67],
    'Y' : [4,7,12,56,26,78,94,23,56,34,800],
})

In [53]:
txs2[txs2['X']>600] #mostra linhas com valor da coluna maior que determinado numero

      X   Y
7  1200  23

In [ ]:
# Dropar linhas maiores que 30
df.drop(df[df.X>30].index ,inplace=True)

In [55]:
txs2['X'][txs2['X']>600] = st.median(txs2['X']) #substitui o valor discrepante da coluna X pela mediana desta

# Engenharia de Variáveis

In [ ]:
#convertendo tipo de dado
df.X = df.X.astype('int64')
df.Y = df.Y.astype('str')

In [3]:
txs2 = pd.DataFrame({
    'X' : ['A','B','C','D','E','F','G'],
    'Y' : [1,2,3,4,5,6,7],
})
txs2

   X  Y
0  A  1
1  B  2
2  C  3
3  D  4
4  E  5
5  F  6
6  G  7

In [65]:
#Associaçao de Colunas#

In [4]:
ass = {
    'A' : 'BR',
    'B' : 'BR',
    'C' : 'ARG',
    'D' : 'ARG',
    'E' : 'BR',
    'F' : 'ENG',
    'G' : 'ENG',
}

In [8]:
txs2['cat'] = txs2['X'].map(ass) #adicionar uma coluna nova com uma correspondencia
txs2

   X  Y  cat
0  A  1   BR
1  B  2   BR
2  C  3  ARG
3  D  4  ARG
4  E  5   BR
5  F  6  ENG
6  G  7  ENG

In [9]:
txs2.replace(['BR','ENG'], ['DFS', 'DEN']) #substitui os valores das listas, na ordem

   X  Y  cat
0  A  1  DFS
1  B  2  DFS
2  C  3  ARG
3  D  4  ARG
4  E  5  DFS
5  F  6  DEN
6  G  7  DEN

In [ ]:
#Nova coluna relacionada numericamente
df['X'] = (df['Y'] * 20)

In [ ]:
# Criando uma função para categorização de dados.
def categoriza(s):
    if s >= 50:
        return 'X'
    elif s >= 30:
        return 'Y'
    elif s >= 15:
        return 'Z'

In [ ]:
#Aplicando a funcao acima
df['categoria_cat'] = df['coluna_base'].apply(categoriza)

In [47]:
#Caso a função tem dois valores como return, criando uma coluna para cada
df['categoria_cat1'], df['categoria_cat2'] = zip(*df['coluna_base'].apply(categoriza))

In [ ]:
# Criando categorias a partir de uma condições
df['X'] = np.where(df['Y'] < 20, 'A', 'B')

In [ ]:
#Tornar valores como categorias outros
freq = df['x'].value_counts(normalize=True) #mostra as frequencias de cada categoria
pequenas_freq = freq[freq<0.05].index
df['x'] = df['x'].replace[pequenas_freq, 'Outras']

In [ ]:
#Diferenca de uma linha em relacao a anterior
df['X'] = df.Y.diff()
#Diferenca percentual
df['X Percentual'] = df.Y.pct_change()*100

In [ ]:
#Soma acumulada agrupada
df['soma_agrupada'] = df.groupby('X').Y.cumsum() #Y é a variavel quantitativa a ser somada

In [ ]:
#Inserir na coluna a contagem de frequencia de uma observacao
df['contagem_x'] = df.groupby('x').cumcount() + 1
df['contagem_x_e_y'] = df.groupby(['x','y']).cumcount() + 1

In [ ]:
#Criar classes em variavel quantitativa

In [22]:
x = [3,5,7,8,20,25,30,100,120,6,8,9,12,11,50,45,67,23,98,120,34,45,25,65]

In [23]:
categorias = [2,29,39,55,140]

In [25]:
y = pd.cut(x,categorias) #divide o objeto x nas categorias passadas acima
y.categories #diz as categorias criadas

IntervalIndex([(2, 29], (29, 39], (39, 55], (55, 140]]
              closed='right',
              dtype='interval[int64]')

In [27]:
nome_categorias = ['PrimeiraCat', 'SegundaCat', 'TerceiraCat', 'QuartaCat']

In [30]:
y = pd.cut(x, categorias, labels = nome_categorias) #coloca nome nos intervalos criados (categorias)
y

[PrimeiraCat, PrimeiraCat, PrimeiraCat, PrimeiraCat, PrimeiraCat, ..., QuartaCat, SegundaCat, TerceiraCat, PrimeiraCat, QuartaCat]
Length: 24
Categories (4, object): [PrimeiraCat < SegundaCat < TerceiraCat < QuartaCat]

In [36]:
y = pd.cut(x, 4, precision=3) #o numero quatro é a quantidade de categorias e o precision o numero de casas decimais
y

[(2.883, 32.25], (2.883, 32.25], (2.883, 32.25], (2.883, 32.25], (2.883, 32.25], ..., (90.75, 120.0], (32.25, 61.5], (32.25, 61.5], (2.883, 32.25], (61.5, 90.75]]
Length: 24
Categories (4, interval[float64]): [(2.883, 32.25] < (32.25, 61.5] < (61.5, 90.75] < (90.75, 120.0]]

In [39]:
y = pd.qcut(x,4) #qcut divide em quantis e, neste caso, em 4
y

[(2.999, 8.75], (2.999, 8.75], (2.999, 8.75], (2.999, 8.75], (8.75, 25.0], ..., (53.75, 120.0], (25.0, 53.75], (25.0, 53.75], (8.75, 25.0], (53.75, 120.0]]
Length: 24
Categories (4, interval[float64]): [(2.999, 8.75] < (8.75, 25.0] < (25.0, 53.75] < (53.75, 120.0]]

In [42]:
y = pd.qcut(x,[0, 0.2,0.5,0.8,1]) #podemos passar os quantis desejado
y

[(2.999, 8.0], (2.999, 8.0], (2.999, 8.0], (2.999, 8.0], (8.0, 25.0], ..., (65.8, 120.0], (25.0, 65.8], (25.0, 65.8], (8.0, 25.0], (25.0, 65.8]]
Length: 24
Categories (4, interval[float64]): [(2.999, 8.0] < (8.0, 25.0] < (25.0, 65.8] < (65.8, 120.0]]

In [66]:
#Dummies#

In [70]:
txs2 = pd.DataFrame({
    'X' : ['A','B','C','D','E','F','G'],
    'Y' : [1,2,3,4,5,6,7],
})

In [71]:
txs2 = txs2.join(pd.get_dummies(txs2['X'],prefix='dummie_')) #cria uma dummie da variavel X e adiciona a tabela

In [72]:
txs2

,X,Y,dummie__A,dummie__B,dummie__C,dummie__D,dummie__E,dummie__F,dummie__G
0,A,1,1,0,0,0,0,0,0
1,B,2,0,1,0,0,0,0,0
2,C,3,0,0,1,0,0,0,0
3,D,4,0,0,0,1,0,0,0
4,E,5,0,0,0,0,1,0,0
5,F,6,0,0,0,0,0,1,0
6,G,7,0,0,0,0,0,0,1

# Amostragem

In [ ]:
#Aleatoria simples

In [46]:
txs2 = pd.DataFrame({
    'X' : ['A','B','C','D','E','F','G'],
    'Y' : [1,2,3,4,5,6,7],
})

In [47]:
txs2.sample(n=3) #pega uma amostra de 3 linhas - sem reposição, obs: poderia-se usar o parametro frac = x, em que x seria 
# uma fracao da base

   X  Y
4  E  5
3  D  4
1  B  2

In [63]:
txs2.sample(n=6,replace=True) #pega uma amostra de 6 linhas - com reposição

   X  Y
2  C  3
1  B  2
0  A  1
5  F  6
1  B  2
6  G  7

In [48]:
#Aleatoria Estratificada

In [2]:
pokemon = pd.read_csv('pokemon.csv')

In [59]:
pokemon.shape

(801, 41)

In [51]:
pd.value_counts(pokemon['type1'])

water       114
normal      105
grass        78
bug          72
psychic      53
fire         52
rock         45
electric     39
ground       32
poison       32
dark         29
fighting     28
dragon       27
ghost        27
steel        24
ice          23
fairy        18
flying        3
Name: type1, dtype: int64

In [53]:
from sklearn.model_selection import train_test_split

In [72]:
n_amostral = 200

In [73]:
classe = pokemon['type1'].unique()

In [74]:
n_por_classe = round(n_amostral/len(classe))

In [75]:
# a proporcao amostral por classe é proporcional a frequencia de cada categoria
amostras_por_classe = []
for x in classe:
    index = pokemon['type1'] == x
    obs_c = pokemon[index]
    proporcao_c = len(obs_c) / len(pokemon)
    qtde_c = round(proporcao_c * n_amostral)
    amostra_c = obs_c.sample(qtde_c)
    amostras_por_classe.append(amostra_c)
amostra_estratificada = pd.concat(amostras_por_classe)

In [76]:
amostra_estratificada.shape

(199, 41)

In [3]:
pokemon = pokemon.reset_index()

In [4]:
pokemon.head()

,index,abilities,against_bug,against_dark,against_dragon,against_electric,against_fairy,against_fight,against_fire,against_flying,...,percentage_male,pokedex_number,sp_attack,sp_defense,speed,type1,type2,weight_kg,generation,is_legendary
0,0,"['Overgrow', 'Chlorophyll']",1.0,1.0,1.0,0.5,0.5,0.5,2.0,2.0,...,88.1,1,65,65,45,grass,poison,6.9,1,0
1,1,"['Overgrow', 'Chlorophyll']",1.0,1.0,1.0,0.5,0.5,0.5,2.0,2.0,...,88.1,2,80,80,60,grass,poison,13.0,1,0
2,2,"['Overgrow', 'Chlorophyll']",1.0,1.0,1.0,0.5,0.5,0.5,2.0,2.0,...,88.1,3,122,120,80,grass,poison,100.0,1,0
3,3,"['Blaze', 'Solar Power']",0.5,1.0,1.0,1.0,0.5,1.0,0.5,1.0,...,88.1,4,60,50,65,fire,NaN,8.5,1,0
4,4,"['Blaze', 'Solar Power']",0.5,1.0,1.0,1.0,0.5,1.0,0.5,1.0,...,88.1,5,80,65,80,fire,NaN,19.0,1,0